-- : 한 줄 주석(코드에 영향을 주지 않는 설명문을 작성하는 곳) //: 불안정한 주석 쓰지마라!
/* : 범위 주석 */

/* 도구 탭 -> 환경설정 -> 밑에서 두 번째에 있는 코드편집기 (+) 클릭
    -> 글꼴 클릭해서 글꼴 수정 */

/*워크시트 저장 후 불러와서 사용하는 방법 :
왼쪽 위에 디스켓 모양을 누르면 저장
다시 불러올 때는 왼쪽에 있는 폴더 아이콘(불러오기) 눌러서 열기
*/    

/* 코드 실행(ctrl + Enter)
   커서를 항상 실행하고자 하는 문장 위에 올려놓고 실행하여야 한다.*/

/* ★★★★★ : 한 문장이 끝나면 마침표의 의미로 세미콜론을 항상 사용해 주어야 
               쓰지 않으면 오류가 난다. */

SELECT *
FROM 직원  ;

SELECT *
FROM 부서;

/*범위 실행 : 실행하고자 하는 문장의 시작부터 끝까지 
            드래그로 블록 씌운 후 실행(ctrl + Enter)하면 됨 */
            
